Repository: CharlesLgn/RestGo
Catalog: RestManFront/RestMan/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr

# Accueil
source: Home
fr_fr: Accueil

# Auteurs
source: Authors
fr_fr: Auteurs

# Body
source: Request's body
fr_fr: Corps de la requête

# btSujet
source: See the subject
fr_fr: Voir le sujet

# Entetes
source: Headers
fr_fr: Entêtes

# IndicationContenu
source: The client part and the server part are not necessarily in the same programming language
fr_fr: La partie client et la partie serveur ne sont pas forcément dans le même langage de programmation

# IntroSujet
source: The goal of this lab is to recreate in a very simplified way a web browser. The project will consist of 2 elements: - a client interface that will act as a browser. In this browser, we will have: - an input field for the url that you want to call, - a drop-down list to select the content-type, - a drop-down list for the method used (GET, POST, etc ...) - a drop-down list to indicate the language used, - a text field to send parameters - a button to send our request, - a field to display the result (return headers and data) - a server that will have to: - interpret the request received, - return the correct content according to the headers used, - indicate the success or failure of the operation (HTTP codes seen in progress) In summary you are asked to reproduce the debug window HTTP requests that you can launch from any browser by pressing F12. Your client interface could theoretically work by pointing to any url. I will ask you to develop for the server part several webservices: - the article webservice: - an article is composed of an identifier generated at creation, a label, a price and the identifier a category - the webservice GET / articles will return the list of articles, - the webservices GET / article /: id will return an article in particular (where: id is the identifier of the article), - the POST / article webservice will create an article, - the webservice DELETE / article /: id will delete an article - the webservice category: - a category is composed of an identifier (generated at creation), and a label, - the webservice GET / categories will return the list of categories, - the webservices GET / category /: id will return a particular category (where: id is the identifier of the category), - the POST / category webservice will create a category, - DELETE webservice / category /: id will delete a category Of course, the call to a web service that does not exist or with the wrong method will have to return the http code corresponding.
fr_fr: Le but de ce TP est de recréer de manière très simplifiée un navigateur web. Le projet se composera de 2 éléments: - une interface cliente qui fera office de navigateur. Dans ce navigateur, on aura : - un champ de saisie pour l’url que l’on souhaite appeler, - une liste déroulante pour sélectionner le content-type, - une liste déroulante pour la méthode utilisée (GET, POST, etc …) - une liste déroulante pour indiquer la langue utilisée, - un champ texte pour envoyer des paramètres - un bouton pour envoyer notre demande, - un champ pour afficher le résultat (entêtes de retour et données) - un serveur qui devra: - interpréter la demande reçue, - renvoyer le bon contenu en fonction des entêtes utilisés, - indiquer le succès ou l’échec de l’opération (les codes HTTP vu en cours) En résumé il vous est demandé de reproduire la fenêtre de débogage des requêtes HTTP que vous pouvez lancer depuis n’importe quel navigateur en appuyant sur F12. Votre interface cliente pourrait en théorie fonctionner en indiquant n’importe quelle url. Je vous demanderai de développer pour la partie serveur plusieurs webservices: - le webservice article: - un article est composé d’un identifiant généré à la création, d’un libellé, d’un prix et de l’identifiant d’une catégorie - le webservice GET /articles renverra la liste des articles, - le webservices GET /article/:id renverra un article en particulier (où :id est l’identifiant de l’article), - le webservice POST /article créera un article, - le webservice DELETE /article/:id supprimera un article - le webservice catégorie: - une catégorie est composée d’un identifiant (généré à la création), et d’un libellé, - le webservice GET /categories renverra la liste des catégories, - le webservices GET /catégorie/:id renverra une catégorie en particulier (où :id est l’identifiant de la catégorie), - le webservice POST /categorie créera une catégorie, - le webservice DELETE /categorie/:id supprimera une catégorie Bien entendu, l’appel à un webservice inexistant ou avec la mauvaise méthode devra renvoyer le code http correspondant.

# LancerName
source: Launch request
fr_fr: Lancer la requête

# Langue
source: Language
fr_fr: Langue

# Livrables
source: Deliverables
fr_fr: Livrables

# Projet
source: Project made by
fr_fr: Projet réalisé par

# Propos
source: About
fr_fr: À propos

# Reponse
source: Response
fr_fr: Réponse

# Sujet
source: Subject
fr_fr: Sujet

# TitreSujet
source: Project advanced management HTTP
fr_fr: Projet gestion avancée HTTP

# Valeur
source: Values
fr_fr: Valeurs

# VisiterPage
source: Visit website
fr_fr: Visiter la page
